import cv2
import numpy as np

bg = np.zeros((10, 10), 'u1')
bg[3:7, 3:7] = 255
"""
[[  0   0   0   0   0   0   0   0   0   0]
 [  0   0   0   0   0   0   0   0   0   0]
 [  0   0   0   0   0   0   0   0   0   0]
 [  0   0   0 255 255 255 255   0   0   0]
 [  0   0   0 255 255 255 255   0   0   0]
 [  0   0   0 255 255 255 255   0   0   0]
 [  0   0   0 255 255 255 255   0   0   0]
 [  0   0   0   0   0   0   0   0   0   0]
 [  0   0   0   0   0   0   0   0   0   0]
 [  0   0   0   0   0   0   0   0   0   0]]
"""
print(bg)

# 创建一个结构元素
# 第一个参数表述：结构元素形状
# 第二个参数：结构元素尺寸
kernel = cv2.getStructuringElement(cv2.MORPH_RECT,(3,3))
print(kernel)

# 膨胀操作，iterations次数
dilate_img = cv2.dilate(bg, kernel, iterations=1)
"""
膨胀原理：
结构元素在背景矩阵中平移操作，如果结构元素，与感兴趣区域只要发生重叠，那么结构元素中心点，就会标记当前位置为255
平移结束后，标记255的像素点更改为255，实现感兴趣区域范围增加
"""

"""
[[  0   0   0   0   0   0   0   0   0   0]
 [  0   0   0   0   0   0   0   0   0   0]
 [  0   0 255 255 255 255 255 255   0   0]
 [  0   0 255 255 255 255 255 255   0   0]
 [  0   0 255 255 255 255 255 255   0   0]
 [  0   0 255 255 255 255 255 255   0   0]
 [  0   0 255 255 255 255 255 255   0   0]
 [  0   0 255 255 255 255 255 255   0   0]
 [  0   0   0   0   0   0   0   0   0   0]
 [  0   0   0   0   0   0   0   0   0   0]]
"""
print(dilate_img)
