import numpy as np
import copy

"""
arr_3d = np.array([[[1, 2], [3, 4]], [[5, 6], [7, 8]]]) 转成一维数组。请使用至少三种方式
"""
arr_3d = np.array([[[1, 2], [3, 4]], [[5, 6], [7, 8]]])
print(arr_3d)
# 获取reshape = (2, 2, 2)
# 方式一
a = arr_3d.flatten()
print(a)

# 方式二
b = arr_3d.reshape(8)
print(b)

# 方式三
c = np.array([i for i in np.nditer(arr_3d)])
print(c)

"""
使用代码完成下面的二维数组，边界值维1，其余值为0
[[1. 1. 1. 1. 1.]
 [1. 0. 0. 0. 1.]
 [1. 0. 0. 0. 1.]
 [1. 0. 0. 0. 1.]
 [1. 1. 1. 1. 1.]
"""
d = np.ones([5, 5])
d[1:4, 1:4] = 0
print(d)

"""
观察下列数组使用代码完成
a = np.array([
    [1, 4, 2, 5],
    [5, 6, 7, 8],
    [9, 10, 12, 13]
])

c = np.array([
    [8, 7, 255, 6],
    [5, 255, 255, 255],
    [3, 5, 255, 255]
])

最后得到数组:
[[1 4 255 5]
 [5 255 255 255]
 [9 10 255 255]]
"""
a = np.array([
    [1, 4, 2, 5],
    [5, 6, 7, 8],
    [9, 10, 12, 13]
])
c = np.array([
    [8, 7, 255, 6],
    [5, 255, 255, 255],
    [3, 5, 255, 255]
])
print(c == 255)
a[c == 255] = 255
print(a)

"""
如何从numpy数组中提取给定范围内的所有数字？
    问题：从数组a中提取5和10之间的所有项
    输入：d = np.arange(15)
    期望输出：[5, 6, 7, 8, 9, 10]
"""
d = np.arange(15)
e = d[5:11]
print(e)

"""
如何在 2d numpy 数组中交换两个列
    问题：在数组arr中交换1和2列
    arr = np.arange(9).reshape(3, 3)
    [[0 1 2]
     [3 4 5]
     [6 7 8]]
"""
arr = np.arange(9).reshape(3, 3)
"""
思考
    arr[0:, 1:2]
        [[1]
         [4]
         [7]]
    arr[0:, 2:]
        [[2]
         [5]
         [8]]
两者交换即可
"""
# 方式一
# arr1 = copy.deepcopy(arr[0:, 1:2])
# arr2 = copy.deepcopy(arr[0:, 2:])
# arr[0:, 1:2] = arr2
# arr[0:, 2:] = arr1

# 方式二
# arr = arr[:, [0, 2, 1]]
# print(arr)

# 方式三
arr[:, [1, 2]] = arr[:, [2, 1]]
print(arr)

"""
现有四位同学，A、B、C、D对三种舞蹈进行打分的一个数据（总分为10），每个同学
分别行2个维度统计分数：
    1.计算每种舞蹈的评分总和
    2.计算每位同学的评分总和
item = np.array([
    [3, 5, 8],
    [4, 6, 5],
    [3, 8, 3],
    [2, 6, 9]
])
"""
item = np.array([
    [3, 5, 8],
    [4, 6, 5],
    [3, 8, 3],
    [2, 6, 9]
])
# 每种舞蹈的评分总和
print(item[[0], :] + item[[1], :] + item[[2], :] + item[[3], :])
# 每位同学的评分总和
print(item[:, [0]] + item[:, [1]] + item[:, [2]])

# 方式二
# 每种舞蹈的评分总和
s1 = np.sum(item, axis=0)
print(s1)
# 每位同学的评分总和
s2 = np.sum(item, axis=1)
print(s2)